go-go-golems/esp32-s3-m5/0081-atoms3r-wamr-probe-console/sdkconfig.defaults
# AtomS3R WAMR probe defaults (ESP-IDF 5.3.4)

CONFIG_IDF_TARGET="esp32s3"

# Flash and partitions
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# CPU and memory
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# AtomS3R display and backlight defaults
CONFIG_TUTORIAL_0013_LCD_Y_OFFSET=32
CONFIG_TUTORIAL_0013_LCD_SPI_PCLK_HZ=40000000
CONFIG_TUTORIAL_0013_CANVAS_USE_PSRAM=n
CONFIG_TUTORIAL_0013_PRESENT_USE_DMA=y
CONFIG_TUTORIAL_0013_BACKLIGHT_GATE_ENABLE=y
CONFIG_TUTORIAL_0013_BACKLIGHT_GATE_GPIO=7
CONFIG_TUTORIAL_0013_BACKLIGHT_GATE_ACTIVE_LOW=y
CONFIG_TUTORIAL_0013_BACKLIGHT_I2C_ENABLE=y
CONFIG_TUTORIAL_0013_BL_I2C_SCL_GPIO=0
CONFIG_TUTORIAL_0013_BL_I2C_SDA_GPIO=45
CONFIG_TUTORIAL_0013_BL_I2C_ADDR=0x30
CONFIG_TUTORIAL_0013_BL_I2C_REG=0x0e
CONFIG_TUTORIAL_0013_BL_BRIGHTNESS_ON=255

# Prefer USB Serial/JTAG for the interactive console on S3 boards
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_UART_CUSTOM=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_TUTORIAL_0013_CONSOLE_BINDING_USB_SERIAL_JTAG=y
CONFIG_TUTORIAL_0013_CONSOLE_PROMPT="atom> "

# Logging quality-of-life
CONFIG_LOG_COLORS=n

# WAMR baseline: interpreter first, feature set kept intentionally narrow
CONFIG_WAMR_ENABLE_AOT=n
CONFIG_WAMR_ENABLE_INTERP=y
CONFIG_WAMR_INTERP_FAST=y
CONFIG_WAMR_ENABLE_LIB_PTHREAD=n
CONFIG_WAMR_ENABLE_LIBC_BUILTIN=y
CONFIG_WAMR_ENABLE_LIBC_WASI=n
CONFIG_WAMR_ENABLE_MULTI_MODULE=n
CONFIG_WAMR_ENABLE_SHARED_MEMORY=n
CONFIG_WAMR_ENABLE_REF_TYPES=n
